Table of Contents
 Class ISDModel
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Model of IDEA StatiCa Detail
public class ISDModel : OpenElementId
Inheritance
object
OpenObject
OpenElementId
ISDModel
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ISDModel()
Constructor
public ISDModel()
Properties
 Geometry
All geometrical entities of Detail
public List<ReferenceElement> Geometry { get; set; }
Property Value
List<ReferenceElement>
 ISDType
Type of IDEA StatiCa Detail
public ISDType ISDType { get; set; }
Property Value
ISDType
 Loading
All loading entities of Detail
public List<ReferenceElement> Loading { get; set; }
Property Value
List<ReferenceElement>
 Reinforcement
All reinforcement of Detail
public List<ReferenceElement> Reinforcement { get; set; }
Property Value
List<ReferenceElement>
 Setting
Setting
public ISDSetting Setting { get; set; }
Property Value
ISDSetting
 Edit this page